MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DX256VLH7/mcu.h
#define REVID                         0x00078000      // Device revision number
#define FAMID                         0x000001C0      // Kinetis family identification
#define PINID                         0x00000078      // Pincount identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC1 register.
//
//*****************************************************************************

#define Reserved                      0x01000000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x01800000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00200000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x1FF00000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000800      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000400      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000600      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000080      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000040      // This read-only field is reserved and always has the value 0
#define Reserved                      0x000007E0      // This read-only field is reserved and always has the value 0


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC2 register.
//
//*****************************************************************************

#define Reserved                      0x00002000      // This read-only field is reserved and always has the value 0
#define DAC0                          0x00001000      // DAC0 Clock Gate Control
#define Reserved                      0x003FF800      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000001      // This read-only field is reserved and always has the value 0


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC3 register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x40000000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x60000000      // This read-only field is reserved and always has the value 0
#define ADC1                          0x08000000      // ADC1 Clock Gate Control
#define Reserved                      0x04000000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x02000000      // This read-only field is reserved and always has the value 0
#define FTM2                          0x01000000      // FTM2 Clock Gate Control
#define Reserved                      0x1F800000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00020000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x000F0000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00001000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x0003F800      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000010      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000038      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00000001      // This read-only field is reserved and always has the value 0


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC4 register.
//
//*****************************************************************************

#define Reserved                      0x780000000      // This read-only field is reserved and always has the value 1
#define Reserved                      0x3F8000000      // This read-only field is reserved and always has the value 0
#define VREF                          0x00100000      // VREF Clock Gate Control
#define CMP                           0x00080000      // Comparator Clock Gate Control
#define Reserved                      0x00040000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x001E0000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00002000      // This read-only field is reserved and always has the value 0
#define UART2                         0x00001000      // UART2 Clock Gate Control
#define UART1                         0x00000800      // UART1 Clock Gate Control
#define UART0                         0x00000400      // UART0 Clock Gate Control
#define Reserved                      0x00000600      // This read-only field is reserved and always has the value 0
#define I2C1                          0x00000080      // I2C1 Clock Gate Control
#define I2C0                          0x00000040      // I2C0 Clock Gate Control
#define Reserved                      0x00000060      // This read-only field is reserved and always has the value 1
#define Reserved                      0x00000008      // This read-only field is reserved and always has the value 0
#define CMT                           0x00000004      // CMT Clock Gate Control
#define EWM                           0x00000002      // EWM Clock Gate Control
#define Reserved                      0x00000001      // This read-only field is reserved and always has the value 0


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC5 register.
//
//*****************************************************************************

